[
    {
        "title": "DevOps",
        "description": "Tu participeras activement à la réalisation de notre vision DevOps en intégrant toutes ses constituantes dans nos pipelines de livraison. Concrètement, tu travailleras avec les membres de ton équipe pour développer des solutions de déploiement telles que :\nMise en place de pipeline CI/CD\nGestion complète des ouvertures de flux en utilisant de l’infrastructure as code\nIntégration des solutions de scanning de sécurité\nEnvironnement de travail :\nHébergement de nos plateformes sur AWS (Pipeline, EC2, ECS, S3, RDS, ElasticBeanstalk…)\nBaseCamp pour la gestion de projets\nDocker\nContrôle de version (GitHub)\nRapport et tableaux de bord\nMonitoring des applications (AWS CloudWatch)\nWordPress (PHP, ACF, jQuery, Vanilla JS, SCSS/CSS3)\nPython + React\nResponsabilités principales :\nAccompagner les lignes d’affaires à intégrer un nouvel outil dans un contexte DevOps\nMettre en œuvre et supporter le provisionnement des environnements AWS\nAutomatiser les tâches de déploiement et de gestion de la configuration pour une meilleure efficacité\nAssurer la disponibilité, la performance et la sécurité de tous les services AWS\nCollaboration avec les développeurs pour implémenter les meilleures pratiques DevOps\nParticiper à la mise en place et à la gestion des outils de surveillance et de rapport pour les environnements AWS\nContribuer aux avancées de pratiques et favoriser leurs adoptions\nAmélioration de la performance, réduction de coûts, entretien des environnements en place\nMigration de compte AWS\nL’équipe travaille en mode hybride, à Montréal, avec quelques occasions nécessitant de se regrouper pour développer la complicité d’équipe. Nous visons également à t’offrir un maximum de flexibilité dans ton travail pour favoriser ta qualité de vie. Ceci se traduit notamment par l’aménagement du temps de travail pour concilier vie professionnelle et personnelle, et des congés flexibles à des moments qui comptent.\n5 années d’expérience pertinente en DevOps ou SysAdmin\nMaîtrise du français requis\nExpérience en DevOps, notamment en automatisation et en gestion de la configuration\nConnaissance de services AWS\nExpérience en programmation (PHP, Python, React, etc.)\nConnaissance des meilleures pratiques en matière de sécurité AWS\nCapacité à travailler en équipe et à communiquer efficacement avec les différents départements de l’entreprise\nBilingue : Capacité à communiquer en anglais (pour traiter avec des fournisseurs anglophones à l’extérieur du Québec)\nTravailler chez Groupe Contex, c’est profiter d’avantages, tels que :\nUn environnement de travail stimulant, flexible et créatif ;\nUn poste permanent avec un horaire de travail de 35 heures par semaine ;\nUn mode de travail hybride : combinaison de télétravail et de présentiel ;\nUne politique de télétravail à l’étranger ;\nL’accès gratuit à de la télémédecine et une vaste gamme de professionnels via Dialogue ;\nUn programme complet d’assurances collectives ;\nUn REER collectif avec contribution de l’employeur ;\nUn programme de bonification à l’atteinte des objectifs annuels ;\nUn généreux programme de vacances annuelles, incluant une fermeture des bureaux entre Noël et le Jour de l’an ;\nUn horaire d’été ;\nBureaux facilement accessibles en transport en commun ;\nLa possibilité d’assister à plusieurs de nos formations et de nos conférences.\nNos environnements de travail dynamiques et nos outils de collaboration modernes favorisent une expérience employée agréable. Nous accordons une grande place aux idées des employés. Que ce soit par nos sondages, ou encore par l’entremise de nos programmes, le dialogue en continu et la rétroaction sont encouragés.\nType d'emploi : Permanent, Temps plein\nAvantages :\nAssurance Dentaire\nAssurance Invalidité\nAssurance Vision\nÉvénements d'Entreprise\nProgramme d'Aide aux Employés\nREER Collectif\nTenue Décontractée\nHoraires de travail :\nDu Lundi au Vendredi\nCapacité à faire le trajet ou à déménager:\nMontréal, QC H3B 1A5: Faire le trajet sans problème ou prévoir un déménagement avant de prendre son poste (Obligatoire)\nExpérience:\nDevOps ou SysAdmin: 5 ans (Obligatoire)\nLangue:\nFrançais (Obligatoire)\nLieu du poste : Télétravail hybride à Montréal, QC H3B 1A5",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BMmmBYw16ALUF6TRHRZGXJTyxFFX1TZg4bUfPPDSohWgncw50uDzZLnI_LUl-6jMmlimDW3f0keETTFnOaTrmDVePR5mvN6mobdlLI4_qTYbHnXnkJZoJUsSLLYUjy2xy2uCsEKVHI5wFD9KJQN0t68xJWaYGKaX1OqMnYz1_XZuGruTsTxzC643CX6jC8V8iNEyyzZ7H3qdmgL1zTMWJ4QaWe7E6eUPrrQ0xsJVF3Zk1LP8urCzxnaFA5J0muYuvhdUjVT8CveVAGvMwy0DUFob3ciw4jKF_8DJCwEZOsO2HYeB-EgcLb-xwUoQPOZHwuZf3C5asJqqSyUuwpGDB2qkASYONS7ixjeyvSD-JZfHYOrABGfdYfCCMo99gxSns-Zxuhbu_AoCMbCtVx8rXKFez7DZW-EJEkcVb40U7JJntNZhuR5ao44W8_Jn-peetZ3Fe3h0eI5cbCL8DpWkkMmwGzGpkXmhkI2Do-aHHO7j4gjlvkQwO6J0H7RfvRwEssRNWDNfh3Z_JhQbzEwR9JaEgVg2V1DVRT9X0d8XnbLJhDnoVzXIsYZrL_KbmTznY=&xkcb=SoAp-_M3HCegYtQ3hZ0KbzkdCdPP&p=0&fvj=1&vjs=3"
    },
    {
        "title": "DevOps Cloud - Computing Expert",
        "description": "At Desjardins, we believe in equity, diversity and inclusion. We're committed to welcoming, respecting and valuing people for who they are as individuals, learning from their differences, embracing their uniqueness, and providing a positive workplace for all. At Desjardins, we have zero tolerance for discrimination of any kind. We believe our teams should reflect the diversity of the members, clients and communities we serve.\nIf there's something we can do to help make the recruitment process or the job you're applying for more accessible, let us know. We can provide accommodations at any stage in the recruitment process. Just ask!\nJob Level\nNV-09\nAs part of its digital strategy, Desjardins is transforming the development services our department offers to squads to include a platform as a service (PaaS) with Pivotal Cloud Foundry (PCF) technology, a container as a service (CaaS) platform with Kubernetes (AKS/PKS) technology, tools and a continuous delivery practice (GitHub/Bitbucket, Artifactory, SonarQube, Concourse/Jenkins, etc.), acceptance tests and templates, and a campus for training and supporting the squads.\n\nThe Development and Operations of Cloud Foundations and Continuous Delivery Department is seeking to build its team to meet the growing demand for its services. If you’re passionate about cloud technologies, curious about new approaches and tools, a solid Agile team member, multi-talented, and committed, then we have opportunities for you!\nGeneral Information on the Position\nMain responsibilities\nMaintain the continuous delivery platform of Desjardins’s cloud computing environments\nPrepare, document and implement the platform’s infrastructure and tools\nHelp develop and update the platform\nSupport and assist the development squads in implementing their application delivery solution\nInvestigate and solve production incidents.\nOther working conditions\nSchedule: The incumbent may be required to provide computer support outside working hours from time to time\nWorkplace: Position located in Montreal or Levis, depending on the applicant selected. The work arrangement for the position is hybrid work #LI-Hybrid\nNumber of jobs available: 1\nQualifications\nBachelor’s degree in a related field\nA minimum of two years of relevant experience\nExperience in implementing solutions in a production environment\nExperience in Agile mode (an asset)\nPlease note that other combinations of qualifications and relevant experience may be considered.\nFor vacant positions available in Quebec, please note that knowledge of French is required.\nSpecific knowledge\nVery good knowledge of Shell BASH scripting\nKnowledge of the architecture of continuous delivery platforms and products: GitHub, Artifactory and SonarQube\nKnowledge of Kubernetes and Docker\nKnowledge of Azure cloud platform\nKnowledge of DevOps concepts (CI/CD)\nKnowledge of a Docker-based CI/CD tool (GitHub Actions, GitLab, Concourse)\nKnowledge of a cloud platform (Azure and/or AWS)\nKnowledge of Python\nKnowledge of the \"Infrastructure as Code\" concept with tools such as Terraform\nKnowledge of the Ansible configuration management tool\nKnowledge of Linux, Ubuntu and Red Hat\nKnowledge of Jenkins, Azure DevOps and HashiCorp Vault (an asset)\nDesjardins Cross-sector skills\nAction oriented, Customer Focus, Differences, Nimble learning\nKey competencies for the job\nComplexity, Plans and aligns, Tech savvy\nWork Location\nComplexe Desjardins Montréal\nTrade Union\nNon Syndiqué\nUnposting Date\n2023-11-28\nJob Family\nInformation technology (FG)\nDesjardins Group is the largest cooperative financial group in Canada, and one of the largest employers in the country. It offers a full range of financial products and services and is home to a wealth of expertise in property and casualty insurance, life and health insurance, wealth management, services for businesses of all sizes, securities brokerage, asset management, venture capital, and secure, leading-edge virtual access methods.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=6faeaf036d11c77f&fccid=d1e5df65baa8857f&vjs=3"
    },
    {
        "title": "Junior DevOps Engineer",
        "description": "Pax8 is the leading value-added cloud-based SaaS distributor, simplifying the cloud journey for our partners by integrating technology, business intelligence and proactive service to deliver an unparalleled experience. Serving thousands of partners through the indirect sales channel, our mission is to be the world's favorite place to buy cloud products. We are a fast-growing, dynamic and high-energy startup organization, allowing you to make a meaningful impact on the business. Culture is important to us, and at Pax8, it's business, and it IS personal. We are passionate, creative and humorously offbeat. We work hard, keep it fun, and expect the best.\nWe Elev8 each other. We Advoc8 for our partners. We Innov8 continuously. We Celebr8 life.\nNo matter who you are, Pax8 is a place you can call home. We know there's no such thing as a \"perfect\" candidate, so we don't look for the right \"fit\" – instead, we look for the add. We encourage you to apply for a role at Pax8 even if you don't meet 100% of the bullet points. We believe in cultivating an environment with a diversity of perspectives, in hopes that we can all thrive in an inclusive environment.\nWe are only as great as our people. And we have great people all over the world. No matter where you live and work, you're a part of the Pax8 team. This means embracing hybrid- and remote-work whenever possible.\nPosition Summary:\nThe Jr. DevOps Engineer is a sharp, disciplined self-starter with foundational DevOps skills and a strong desire to learn. They handle ad-hoc engineering requests, general housekeeping and assist with project work. The Engineer is available for after hours work as required to support availability, releases, and maintenance.\nEssential Responsibilities:\nAddress DevOps team tickets\nAssist and collaborate with DevOps engineers\nRemediate and maintain the security and access controls for supported services\nParticipate in Reliability and on-call rotations\nIdeal Skills, Experience, and Competencies:\nCustomer focused- building strong customer relationships and delivering customer-centric solutions.\nDecision quality- making good and timely decisions with an attention to details that keep the organization moving forward.\nInstills trust- gaining the confidence and trust of others through honesty, integrity, and authenticity.\nOrganizational savvy- maneuvering comfortably through complex policy, process, and people-related organizational dynamics.\nTech savvy- anticipating and adopting innovations in business-building digital and technological applications.\nExperience with AWS services, Git, and programming/scripting language skills in Python, AWS CLI and Bash.\nStrong desire to continuously learn and stay updated on DevOps trends, tools and automation practices.\nAbility to build strong customer relationships and deliver customer-centric solutions.\nAbility to make good and timely decisions that keep the organization moving forward.\nAbility to gain the confidence and trust of others through honesty, integrity, and authenticity.\nAbility to maneuver comfortably through complex policy, process, and people-related organizational dynamics.\nAbility to anticipate and adopt innovations in business-building digital and technology applications.\nRequired Education & Certifications:\nB.A./B.S. in related field or equivalent work experience\nCompensation:\nQualified candidates can expect a salary beginning at $62,000 CAD or more depending on experience\n#LI-Remote #LI-JF1 #BI-Remote #DICE-J",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=88dad44fc336eaf4&fccid=15364687312b16af&vjs=3"
    },
    {
        "title": "Azure DevOps",
        "description": "Unleash Engagement with Metalab! Join our team in transforming user experiences!\nLevel up your skills and be part of the gaming revolution!\nMetalab is the proud SI arm of a group of companies, including Alice & Smith (A&S) and Youville Haussmann Park (YHP). YHP and A&S are partner studios that specialize in applying gaming mechanics and ideology across a wide range of industries and brands. Our cutting-edge gamification engine, built on Microsoft Azure PlayFab, empowers companies to create captivating ecosystems.\nYHP is renowned for its expertise in engagement and experiential activations, working with Red Bull, Bugatti, Genetec, BRP, and more.\nA&S is a master of gaming fandom and PR, as well as a pioneer in the world of Alternate Reality Games (ARGs). Clients include Hello Games, Paradox Interactive, Twitch, and more.\nYHP is an agency that creates experiences. Not just brand experiences, not just experiential, not just events. Its specialty is to create palpable emotions to create a lasting commitment between a brand and its consumers, and thus strengthen the bond between them. YHP partners with its clients to plan, execute and capture sensory and memorable moments. Drawing on industry best practices, YHP designs experiential campaigns that are always remarkably well thought out, both online and in person.\nA&S is a world leader in the development and integration of Microsoft Azure PlayFab technology. A&S also created XR Server, a no-code API toolkit that empowers brands to operate LiveOps-driven engagement campaigns with consummate ease. XR Server is the culmination of decades of gamification experience, expertise, and success.\nWe are now looking to grow our Azure DevOps team at our Montreal office.\nAs an Azure DevOps, you will:\nBuild, implement, and manage robust CI/CD pipelines using Azure DevOps tools for efficient software deployment.\nAdminister and optimize Linux-based systems to ensure high availability, security, and performance.\nMonitor, troubleshoot, and resolve issues related to infrastructure, deployments, and application performance.\nImplement and maintain infrastructure as code (IaC) using tools like Terraform and/or Bicep for Azure resources.\nEnsure compliance with security and regulatory standards in all aspects of Azure cloud and Linux administration.\nCollaborate with cross-functional teams to enhance and optimize cloud-based applications for scalability and reliability.\nProvide technical expertise and support to team members, fostering a culture of knowledge sharing and collaboration.\nRequirements:\nTech Skills:\nMinimum 3 to 5 years of experience, ideally with a solid combination of Azure DevOps expertise + Linux SysAdmin background.\nOwn Azure Certification(s) – Ideally (but not exhaustive):\n- Microsoft Certified: Azure Administrator Associate\n- Microsoft Certified: DevOps Engineer Expert\n- Microsoft Certified: Azure Network Engineer Associate\n- Microsoft Certified: Azure Solutions Architect Expert…\nProven experience in setting up and managing CI/CD pipelines using Azure DevOps tools.\nHands-on experience with tools such as Terraform and Bicep/ARM templates for automating infrastructure deployment and management.\nStrong proficiency in Azure services, including but not limited to virtual machines, storage, networking, and security.\nExpertise in administering Linux-based systems, with a focus on performance optimization, security, and troubleshooting.\nProficient in scripting languages (e.g., PowerShell, Bash, az cli) for automating routine tasks and creating efficient workflows.\nUnderstanding of security best practices in Azure and the ability to ensure compliance with industry standards and regulations.\nExperience in implementing monitoring solutions and diagnosing and resolving infrastructure and application issues.\nSoft skills:\nStrong collaboration and communication skills to work effectively with cross-functional teams and articulate technical concepts to non-technical stakeholders.\nDemonstrated commitment to staying updated on emerging technologies, industry trends, and best practices in cloud and DevOps.\nSolid communication skills in English.\nNice to have:\nFrench proficiency.\nHands-on experience with tools such as Packer for automating image deployment.\nHands-on experience with tools such as Ansible for configuration management.\nKnowledge of containerization technologies, preferably Docker, and orchestration tools like Kubernetes.\nKnowledge of event driven and API typologies and patterns.\nBeing physically in Montreal as a best option, Canada in the EST time zone at least.\nJob Types: Full-time, Permanent\nSalary: $77,683.70-$129,650.30 per year\nBenefits:\nDental care\nExtended health care\nPaid time off\nSchedule:\nDay shift\nMonday to Friday\nExperience:\nDevOps: 3 years (required)\nLinux SysAdmin: 2 years (required)\nLanguage:\nEnglish (required)\nLicence/Certification:\nAzure Certifications (required)\nWork Location: Hybrid remote in Montréal, QC H4C 3C5",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/company/Youville-Haussmann-Park/jobs/Development-Operations-Engineer-8c48d69c53713921?fccid=81fa5b3fa900a6d6&vjs=3"
    },
    {
        "title": "DevOps Developer - Cloud - (remote)",
        "description": "Our client is a leading, Fortune 500 , world wide telecom vendor that works on awesome technologies such as 5G, Wired Networks and Cloud. They are looking to add a DevOps Developer to their expanding team that is working on a multi-year project developing an internal tool, a Customer Service Delivery Platform which will be used by their clients such as BELL/Telus/Rogers.\nThis is a 12 month contract to start but could go multi-year.\nThe role can be performed remotely for the duration of the contract.\n\nPosition Overview\nwork with a very large team that is developing a custom Customer Solutions Delivery Platform which will be used by BELL/Telus/Rogers and other clients\nDevelop key components of the system with DevOps/Kubernetes technology\nIntegration and deployment of Kubernetes using CD tools\nCreating CI/CD pipelines\nWorking with Ansible to perform multi-stage workflows\ndeveloping agnostic scripts for multi-cloud\nwork with current DevOps and Development teams to create a top notch final product\n\nDevOps Engineer\nCore competences:\nunderstanding of Kubernetes resources like deployments, ingress, services, pods and containers\nConfiguration of Kubernetes with Kubespray , Kops, Kubeadm or Ansible\nCreating Custom Resource Definitions with Kubernetes\nConfigu\nIn depth understanding of Docker containers.\nMicroservice management in Kubernetes using Helm.\nWriting Ansible / Chef/ Puppet / Python / Bash scripts to automate infrastructure.\nCI / CD knowledge & experience\nFamiliarity with GitOps",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=be7f05fb99385248&fccid=991677c8d1dc29b5&vjs=3"
    },
    {
        "title": "DevOps Platform",
        "description": "Our employees are at the heart of what we do best: helping people, businesses and society prosper in good times and be resilient in bad times. When you join our team, you’re bringing this purpose to life alongside a passionate community of experts.\nFeel empowered to learn and grow while being valued for who you are– here, diversity is a strength. You have our commitment to support you in reaching your goals with tools, opportunities, and flexibility. It’s our employee promise.\nOur hybrid work model provides the balance between working from home and enjoying meaningful in-person interactions.\nRead on to see how you can shape the future, win as a team, and grow with us.\nAbout the role\nWe are looking for a DevOps to join our growing DevOps Platform and COE team!\nOur team is composed of a diversified mix of DevOps specialists, developpers, integrator and DevOps Coaches building a platform and an ecosystem to be used by hundreds of developers in dozens of software engineering teams in Intact.\nThe ecosystem allows to build new environments, integrate and deploy code continuously while running automated tests, update observability tools in order to support continuous improvement across the full software development lifecycle.\nWhat you’ll do here:\nEnsure best practices in configuration management, development cycle and security are being followed.\nWork closely with software engineering teams to support them in the process of using the development lifecycle tool chain and platforms.\nAssist software engineering teams in upgrading their current tools and technologies to the DevOps COE recommendations.\nSupport software engineering teams in their use of DevOps tools and processes to improve their efficiency.\nContinuously improve our DevOps tools and processes.\nParticipate actively in the company's DevOps Community of Practice.\nDevelop technical initiatives to make software engineering teams more effective.\nParticipate in R&D initiatives on our technical solutions in connection with our tools, platforms and processes.\nWhat you bring to the table:\nUndergraduate degree in computer science or any combination of equivalent education and experience.\n3-5 years of IT experience.\nExcellent knowledge of DevOps technologies: Docker, OpenShift, Kubernetes, Jenkins, Nexus/Nexus IQ, Maven.\nExcellent knowledge of software engineering tools: GitHub, Jira, Confluence.\nVery good extended knowledge of different technologies such as: Tomcat, JBoss, Websphere, VM Ware, Ubuntu Linux, etc.\nVery good knowledge of scripting: Groovy, Python, Ansible, Bash, YAML, Perl.\nKnowledge of cloud technologies: AWS and Azure.\nKnowledge of Infrastructure as Code tools: Ansible, Terraform.\nExperience with monitoring and alert technologies: Grafana, Prometheus, Dynatrace, Splunk.\nKnowledge in the integration of test automation frameworks: Selenium, Cucumber, JMeter.\nGood knowledge of Java and Java JEE development environments.\nGood knowledge of Agile development environment (SCRUM and Kanban).\nExperience of build processes and continuous deployment (CI/CD).\nKnowledge of the following technologies is an asset: Twistlock, Veracode, SonarQube, SysDig, SpringBoot, Harshicorp Vault.\nLeadership skills.\nCommunication skills.\nTeam player, collaborative and good learning ability.\nAutonomous and excellent management of priorities.\nVersatile and abreast of new technologies.\nCurious, self-taught and active in DevOps communities.\nInitiative and ability to work under pressure.\nMust be bilingual (French / English) – Need to interact on a regular basis with colleagues across the country.\nNo Canadian work experience required however must be eligible to work in Canada.\n#LI-Hybrid\nWhat we offer\nWorking here means you'll be empowered to be and do your best every day. Here is some of what you can expect as a permanent member of our team:\nA financial rewards program that recognizes your success\nAn industry leading Employee Share Purchase Plan; we match 50% of net shares purchased\nAn extensive flex pension and benefits package, with access to virtual healthcare\nFlexible work arrangements\nPossibility to purchase up to 5 extra days off per year\nAn annual wellness account that promotes an active and healthy lifestyle\nAccess to tools and resources to support physical and mental health, embracing change and connecting with colleagues\nA dynamic workplace learning ecosystem complete with learning journeys, interactive online content, and inspiring programs\nInclusive employee-led networks to educate, inspire, amplify voices, build relationships and provide development opportunities\nInspiring leaders and colleagues who will lift you up and help you grow\nA Community Impact program, because what you care about is a part of what makes you different. And how you contribute to your community should be just as unique.\nWe are an equal opportunity employer\nAt Intact, we value diversity and strive to create an inclusive, accessible workplace where all individuals feel valued, respected, and heard.\nIf we can provide a specific adjustment to make the recruitment process more accessible for you, please let us know when we reach out about a job opportunity. We’ll work with you to meet your needs.\nClick here to review other important information about the hiring process, including background checks, internal candidates, and eligibility to work in Canada.\nIf you are an employee of Intact or belairdirect, please apply for this role on Contact People.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=645a810254586c35&fccid=a614b30520ebe6c9&vjs=3"
    },
    {
        "title": "Hiver 2024 - Stagiaire en développement logiciel DevOps",
        "description": "Description de l'entreprise\n\nNotre spécialité, c'est d'optimiser! Et nous sommes fiers de notre expertise. Nous mettons à profit notre intelligence collective pour impacter la vie des gens en améliorant l'efficacité de la mobilité urbaine. Nos solutions logicielles innovantes et nos services experts dans les domaines du transport collectif et des opérations postales sont reconnus partout dans le monde.\n\nDescription du poste\n\nL’équipe Outils DevOps secteur livraison est à la recherche d’un stagiaire à la session d'hiver 2024. Chez GIRO, tu feras partie intégrante d’une équipe de développement et collaborera avec des experts logiciels qui ont une riche expertise dans le domaine du transport en commun et des services postaux. Viens grandir et apprendre parmi nous ! Et qui sait ? Peut-être que tu tomberas en amour avec notre domaine d’expertise et désireras y débuter ta carrière .\nTu feras partie d'une équipe curieuse, audacieuse et qui aime dépasser ses limites. Nous préconisons le travail en équipe, tout en intégrant les méthodologies Agile/SCRUM et un peu de folie créative.\nEn plus de découvrir comment travailler en mode agile, un stage en développement chez GIRO c’est:\nParticiper à la transformation technologique (DevOps) et la livraison de projets d’envergures\nDévelopper de nouvelles fonctionnalités dans les applications\nL'intégration de systèmes et l’automatisation de processus\nD’implanter et tester les fonctionnalités de nos logiciels\nDe gérer des OBS (bugs) et de trouver les solutions appropriées pour les corriger\nTon stage impliquera aussi:\nD’offrir un soutien technique aux équipes de développement et de projet qui utilisent les fonctionnalités développées par ton équipe\nDe rédiger des documents d’analyse organique\n\nQualifications\n\nTon profil:\nTu as complété au moins deux années au baccalauréat dans une discipline appropriée ou connexe (informatique, génie informatique ou logiciel, mathématiques, etc.)\nConnaissance de la programmation Python, Terraform, PowerShell, Angular et/ ou de l’environnement .net est un atout\nIntérêt pour la conteneurisation (Kubernetes, Ansible, Grafana)\nFamiliarité avec le cloud (Azure), un atout\nTu aimes travailler en équipe et être dans un environnement collaboratif\nTu communiques en français, parlé et écrit, comme un pro\n\nInformations complémentaires\n\nChez GIRO tu seras rapidement intégré et appelé à contribuer concrètement! Le bien-être et l’épanouissement de nos employés sont des valeurs qui nous tiennent à cœur. C’est pourquoi nous offrons un ensemble d’avantages, dont:\nUn horaire de travail flexible, incluant le télétravail permettant l’équilibre travail/vie personnelle\nUn accueil chaleureux et un programme d’apprentissage personnalisé selon les besoins de développement et de cheminement de carrière de chacun\nPlusieurs activités de reconnaissance et de « Team Building » : déjeuners d’équipe, cours de yoga ou d’aérobie, party de Noël, activités sportives, etc.\nUn remboursement de la carte OPUS ou d’un espace de stationnement\nTu veux en savoir plus? Nous t’invitons à nous soumettre ta candidature et à communiquer directement avec nos conseillers en acquisition de talents!\nAu plaisir de te rencontrer!\nLe générique masculin est utilisé uniquement dans le but d’alléger le texte",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=0585cb8b3566cc0e&fccid=3b38b2af29cc1ea5&vjs=3"
    },
    {
        "title": "DevOps Engineer",
        "description": "Position : Devops Engineer;Location : Montreal, QC, Canada;Type : Full Time / ContractNote : 8+ Years & Need Insurance Domain Experiences.The DevOps engineer'sUnderstanding customer requirements and project KPIsImplementing various development, testing, automation tools, and IT infrastructurePlanning the team structure, activities, and involvement in project management activities.Managing stakeholders and external interfacesSetting up tools and required infrastructureDefining and setting development, test, release, update, and support processes for DevOps operationHave the technical skill to review, verify, and validate the software code developed in the project.Troubleshooting techniques and fixing the code bugsMonitoring the processes during the entire lifecycle for its adherence and updating or creating new processes for improvement and minimizing the wastageEncouraging and building automated processes wherever possibleIncidence management and root cause analysisCoordination and communication within the team and with customersSelecting and deploying appropriate CI/CD toolsStrive for continuous improvement and build continuous integration, continuous development, and constant deployment pipeline (CI/CD Pipeline)Mentoring and guiding the team membersMonitoring and measuring customer experience and KPIsManaging periodic reporting on the progress to the management and the customer.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=3fbe8421245cc72f&fccid=a136d585978e8748&vjs=3"
    },
    {
        "title": "DevOps",
        "description": "Vous souhaitez vous épanouir dans un environnement de travail stimulant ? Joignez-vous au leader en transformation numérique et boostez votre carrière chez Levio. Nous vous proposons une opportunité unique de développer votre savoir-faire au sein d'une équipe de haut calibre.\nLa variété des défis proposés par nos clients vous donnera l'occasion de vous dépasser et de maintenir votre expertise au top. Partagez le quotidien de nos clients et soyez un acteur important dans les projets les plus ambitieux en matière de technologies et de solutions logicielles.\nDESCRIPTION DU POSTE :\nNous sommes à la recherche de plusieurs Devops pour différents projets d'envergure.\nRÔLE ET RESPONSABILITÉS :\nDévelopper et entretenir les environnements de développement\nDévelopper et améliorer les outils internes de supervision et de déploiement (ex : Zabbix/ Ansible/Hudson/Jenkins, etc.)\nMonitorer les métriques applicatives et participer à l'amélioration continue des services et des systèmes\nParticiper à la conception d'applications et la configuration de systèmes d'exploitation\nAccompagner les développeurs dans l'optimisation et la sécurisation des développements\nConcevoir et mener les tests nécessaires pour garantir une automatisation réussie\nPréparer, coordonner et réaliser les installations et mise en production\nMettre en œuvre une procédure d'amélioration continue suite à l'observation des problèmes récurrents\nQUALIFICATIONS ET EXPÉRIENCE :\nBonnes connaissances des outils d'intégration continue\nBonne maîtrise des systèmes opérationnels (Windows, Linux, OSX)\nBonnes connaissances de Docker, Kubernetes, Chef, Puppet, OpenShift, Ansible, Jenkins, Bitbucket et GitLab, Github\nOutils de virtualisation (KVM, VMWare)\nLanguages Java, Ruby, React, Scripting, Python\nServices Web (SOAP et WCF)\nExpérience en environnement Agile\nBilinguisme français-anglais\nAVANTAGES SOCIAUX :\nLevio offre plusieurs avantages dans le but d'offrir la plus grande flexibilité possible à ses employés! En plus d'offrir un environnement de travail stimulant et dynamique, nous offrons entre autres :\nDes assurances collectives\nUn fond de pension\nUne allocation pour le développement professionnel de 2500$\nLe transport en commun ou le stationnement est payé\nDes primes au référencement\nUn club social actif\nStatut du poste : Temps plein, 37,5h/semaine\nLevio souscrit au principe d'équité en emploi et applique un programme d'accès à l'égalité en emploi pour les femmes, les autochtones, les minorités visibles, les minorités ethniques et les personnes handicapées.\nLe genre masculin est utilisé sans aucune discrimination et dans le seul but d'alléger le présent texte.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=fed253184838c83e&fccid=32c9262352d9ac8a&vjs=3"
    },
    {
        "title": "Ingénieur DevOps",
        "description": "Chez Woopen, nous sommes une équipe de gens brillants et travaillants qui tente de créer le 1er market network dédié à l'immobilier et l'habitat. Nous croyons et investissons dans nos collaborateurs et sommes heureux d’offrir une vaste gamme d’avantages tel que les assurances collectives très avantageuses, des horaires flexibles et une politique de travail à temps plein à partir du domicile.\nWoopen permet aux professionnels d'être en lien direct avec leurs clients. Sur Woopen, le professionnel peut mettre en valeur sa personnalité et son savoir-faire sur un réseau dédié à son activité. Il bénéficie en plus d'une audience 100% qualifiée. Woopen a imaginé une solution all-in-one, facile d’utilisation sur mobile ou web qui permet aux professionnels de gagner du temps précieux et de développer leur activité. Il permet également aux particuliers de trouver une réponse à l’ensemble de leurs besoins dans le cadre d’un projet immobilier ou de trouver de l’inspiration. Créé en 2020, Woopen est une start-up franco-canadienne en forte croissance.\nVous allez être offert toute l’autonomie nécessaire à avoir un impact substantiel sur la performance de notre entreprise et votre travail sera créatif et plein de défis – vous ne vous ennuierez jamais. L’efficacité est au centre de nos valeurs et nous travaillons sans relâche à éliminer, automatiser ou externaliser les tâches mondaines et répétitives pour nous et nos partenaires. Si vous pensez être à l’aise dans un environnement où vos collègues sont motivés et compétents, vous avez peut-être trouvé votre nouvelle famille!\n\nVotre contribution\nEn tant qu'ingénieur DevOps, vous serez responsable de la mise en œuvre et de la gestion de solutions d'infrastructure robustes et sécurisées conformes aux réglementations GDPR. Le candidat devrait avoir une solide expérience dans les méthodologies Agile, JIRA, AWS, Sentry, et les pratiques d'infrastructure en tant que code. Ce rôle nécessite une personne proactive avec un souci du détail et une passion pour maintenir un environnement sécurisé et fiable.\n\nResponsabilités\nConcevoir, mettre en œuvre et gérer une infrastructure sécurisée et évolutive sur AWS, en veillant à la conformité aux réglementations GDPR grâce aux meilleures pratiques de DevOps dans le processus de développement Agile.\nSurveiller et maintenir la santé, les performances et la sécurité du système à l'aide d'outils de référence de l'industrie tels que Sentry et d'autres solutions de surveillance pertinentes.\nDévelopper et maintenir des pipelines CI/CD avec GitHub pour les tests automatisés, le déploiement et la surveillance des applications logicielles.\nMettre en œuvre des pratiques d'infrastructure en tant que code pour garantir la cohérence, la fiabilité et la scalabilité sur l'ensemble de la plateforme.\nRésoudre les problèmes d'infrastructure et y apporter des solutions en temps opportun afin de réduire au minimum les temps d'arrêt et d'assurer un fonctionnement fluide.\nDocumenter les processus et les procédures pour maintenir et mettre à l'échelle l'infrastructure, en garantissant une documentation complète et à jour.\n\nCompétences\nUn baccalauréat en sciences informatiques ou équivalent. Excellence académique un atout.\nUne vaste expérience pratique des services AWS, y compris mais sans s'y limiter EC2, S3, RDS, IAM et ECS.\nUne connaissance approfondie des outils d'infrastructure en tant que code tels que Terraform, CloudFormation ou des technologies similaires.\nLa familiarité avec les technologies de conteneurisation telles que Docker et les outils d'orchestration comme Kubernetes est un atout.\nAptitudes\nEngagement envers la qualité des résultats\nPeut proposer des compromis et ouvert à recevoir des commentaires des différents intervenants\nPropose des plans d'action opportuns, réalistes et positifs\nExcellente gestion du temps et capable te travailler sur plusieurs tâches multitâches\nSouci du détail et peut travailler de manière autonome\nExcellentes compétences en communication anglais / français\n\nAvantages sociaux\nNous investissons dans nos employés en offrant les avantages suivants :\nPolitique de travail 100% à domicile (doit être domicilié au Québec).\nAssurance collective complète\nHoraires flexibles\nSupport à l’apprentissage continu et au développement",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=b849dadc91b00f2c&fccid=78f14240c5e22c7e&vjs=3"
    },
    {
        "title": "DevOps Engineer",
        "description": "The project consists of setting up monitoring, alarms and dashboards on the Devops side.\nMandatory technical and practical expertise:\n· Openshift\n· Grafana dashboard\n· Prometheus\n· CI/CD (Teamcity)\n· Helm\n· Experience in implementing Cloud monitoring tools\n· Experience in setting up alert tools\nStrengths\n· Grafana Loki\n· Grafana Tempo\n· Thanos\n· Open Telemetry\n· OpenSearch\n· Elk\nJob Type: Temporary\nSalary: From $65.00 per hour\nSchedule:\nMonday to Friday\nExperience:\nOpenShift: 5 years (required)\nGrafana: 3 years (preferred)\nDevOps: 6 years (required)\nLanguage:\nFrench (required)\nWork Location: In person",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CQSHc5J7VUUA_yokepCrTYZsC9XZpU_l8QgBXAfn4iq5ynckF8MEBgdO5y6Cr1yH0lAtzfW0Tnyitit7YkzQP9jsKqOKqAjQeJPOFAWZdwKswqTt276evoxvh6AFHQ6qTHHECdmqFrpymIgRwasg8_mnkip9XLAZOZHfjxtIkqn_KQ5n8DE6vBZPMWOLHDldlOCesO0J9LCCVGCRBbnd0k4u0CtlqHwMHK5YeFGsmQQm1dxEQ_zayh7O0JYnMzEZCWztyXlXlq2geCpPKAUzofRJod1DuVFDW5ijbhK4bJNyu2bV-w0rbi5nMSUV2VuriPtIRkHRNOLP4EG9pnS_BXxMl-9Bv5Piur3Kylv1GpCGuIQ_ilyvnvTElMAU46ZsagPbnf_og1MPcT4TdnOapXNMaB-gBOg6D3uGpccaRgnIBYnbJy14KopUpi7DtPmbX2sciKr_HgQgGSS4yASPT96oOACPMdFuXaCz80mI2tuATSugbmXOstVOh68VJGc5acDyj2mvorg6z1Vb2X4XkTvH35rznCPJlThRuHdu5HmJlIh57BAavyEk2xZjqADHEUmgfnk9XcywWJ4klp5Q0EfhmDJx2O4k_xBdii5BNHig==&xkcb=SoBn-_M3HCegYtQ3hZ0AbzkdCdPP&p=10&fvj=1&vjs=3"
    },
    {
        "title": "Spécialiste DevOps",
        "description": "POURQUOI TRAVAILLER CHEZ CENTRIS\nTu es passionné par les technologies et tu aimes particulièrement le travail d’équipe ? Tu as à cœur de contribuer et d’évoluer dans un environnement moderne et dynamique où l’excellence et l’innovation sont de mise ? Le plaisir au travail est tout aussi important pour toi, que les résultats ? Ce poste est pour toi !\nCentris t’offre l’opportunité de faire la différence au sein de son équipe à titre de Spécialiste DevOps. Il s’agit d’un poste permanent à temps plein, avec un mode de travail très flexible.\nQUI SOMMES-NOUS\nCentris est une entreprise technologique, dynamique et innovante du secteur immobilier. Elle offre des solutions hautement adaptées aux besoins des professionnels. Parmi ces solutions figure Centris.ca, le site immobilier le plus consulté au Québec.\nLES DÉFIS QUI T’ATTENDENT\nRelevant du Chef des technologies et stratégie d’affaires, le titulaire de ce poste est responsable de la gestion de l’environnement Cloud, des mises en production automatisées et la surveillance de l’environnement Cloud, le tout dans un souci de sécurité.\nPlus spécifiquement, tu devras :\nEffectuer la mise en production et les mises à jour des applications et services développés par Centris en assurant la fiabilité du processus et l’efficacité (responsable des release pipelines, CI/CD) : o Garantir dans une culture DevSecOps et Agile la création de ressources, mises à jour des applications dans les environnements de développement, production, relève, etc. ; o Conseiller, guider et travailler en collaboration avec l’équipe de développement logiciel en place afin de planifier et faciliter les mises en production de l’équipe DevSecOps ; o T’assurer de la mise en place des éléments nécessaires pour faciliter les transitions vers le mode opérationnel (surveillance, alertage, kb, etc.) ; o T’assurer des vérifications régulières de l’état des services sous sa responsabilité ; o T’assurer de l’utilisation efficace des ressources Cloud ;\nVeiller à la haute disponibilité des services et applications critiques dont la relève et la continuité des affaires en cas de sinistre pour les services et les applications Centris (mettre à jour et exécuter régulièrement le plan de relève et de désastre) ;\nFaire une vigie et assurer la mise à jour de la plateforme Cloud Azure\nT’assurer de l’application des politiques, faire des recommandations et mettre en place des procédures pour que le cadre de gouvernance de la Sécurité soit respecté ;\nParticiper à la gestion des incidents et aider à l’identification et résolution des incidents et des problèmes ; www.centris.ca linkedin.com/company/centris/\nParticiper à divers projets en suivant les standards du bureau de projets en place.\nNOUS SOUHAITONS TE RENCONTRER SI TU AS\nUn diplôme d’études collégiales (DEC) en informatique ou toute autre formation jugée pertinente ;\nMinimum cinq (5) ans d’expérience dans des fonctions similaires dont trois (3) ans en DevOps ;\nDe très bonnes connaissances en infonuagique (Microsoft Azure) et Powershell ;\nDes bonnes connaissances des concepts DevOps/DevSecOps, Agile, « Tout en tant que Code » (Everything as Code), automatisation Cloud, etc. ;\nD’excellentes capacités de communication en français, tant à l’oral qu’à l’écrit ;\nUn niveau d’anglais fonctionnel pour assurer les communications avec le support et les fournisseurs ;\nDes habiletés dans l’identification et la résolution de problèmes ;\nUne bonne capacité d’analyse, d’identification de solutions et de respect des principes d’escalade ;\nDes connaissances en sécurité informatique ;\nBonnes connaissances de Microsoft Office, JIRA, Confluence ;\nDes certifications ou des formations Microsoft Azure (des atouts).\nCE QUE NOUS OFFRONS\nUn salaire et des avantages sociaux concurrentiels (assurance collective, REER avec contribution de l’employeur, montant forfaitaire pour ton bien-être, programme d’aide aux employés, service de télémédecine, etc.) ;\nUn mode de travail très flexible pour une meilleure conciliation travail/vie personnelle ;\nDouze (12) journées personnelles octroyées annuellement et payées si inutilisées ;\nDes congés payés pour la période des Fêtes, soit du 24 décembre au 2 janvier inclusivement ;\nDes possibilités de formation et de développement professionnel en continu ;\nUn stationnement gratuit et des bureaux accessibles si tu es en transport en commun (incluant la station REM à proximité) ;\nFinalement, plusieurs activités sociales organisées par Centris pour réseauter et avoir du plaisir en équipe !\nComment postuler?\nTu souhaites relever de nouveaux défis et rejoindre notre équipe? Fais-nous parvenir ta candidature dès maintenant! Si ce poste ne te convient pas, visite notre page https://societecentris.ca/carriere pour plus d’opportunités.\nRenseignements personnels\nEn nous transmettant ta candidature, tu consens à ce que Centris collecte, traite, communique et conserve tes renseignements personnels conformément à sa Politique de confidentialité (https://societecentris.ca/politique-de-confidentialite/).\nÀ noter que l’usage du masculin est utilisé à des fins d’allégement de texte sans aucune discrimination. L’entreprise souscrit aux principes de l’équité en matière d’emploi. Le poste est ouvert à tous les candidats répondant aux critères spécifiés.\nType d'emploi : Temps plein, Permanent\nSalaire : à partir de 80 000,00$ par an\nHoraires de travail :\nQuart de jour\nLieu du poste : Télétravail hybride à Verdun, QC H3E 1A8",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/company/Soci%C3%A9t%C3%A9-Centris-inc/jobs/Devops-74efd17d9209b076?fccid=dc1c430d56a46875&vjs=3"
    },
    {
        "title": "Expert(e) - DevOps infonuagique",
        "description": "Chez Desjardins, on croit à l’équité, à la diversité et à l’inclusion. Nous nous engageons à accueillir toutes les personnes, à les considérer et à les valoriser pour ce qu’elles sont, à nous enrichir de leurs différences et de leur unicité et, surtout, à leur offrir un environnement de travail où elles seront bien. Pour nous, la discrimination, peu importe ses formes, c’est tolérance zéro! Nous croyons en l’importance que nos équipes soient le reflet de la diversité de nos membres, de notre clientèle et des communautés que nous servons.\nSi vous avez besoin d’assistance pour rendre plus accessible le processus de recrutement ou le poste pour lequel vous postulez, veuillez nous en informer. Des mesures d’aménagement seront offertes aux personnes qui en font la demande à n’importe quelle étape du processus de recrutement.\nNiveau d'emploi\nNV-09\nLa Direction Services de plateforme applicative et Livraison continue a comme mission d’offrir les plateformes, les services et les outils permettant aux escouades de développement, livrer et héberger les composantes logicielles afin de répondre aux besoins de nos membres et clients. Une équipe spécialisée au sein de cette direction assure l’établissement d’une gouvernance en automatisation et de cycle de livraison afin d’harmoniser la pratique et répondre aux exigences de sécurité et de conformité.\n\nDans le cadre de sa stratégie numérique, Desjardins est engagé dans une transformation du développement pour laquelle notre direction est responsable d’offrir aux escouades des plateformes de livraison continue CI/CD qui utilisent les produits basés sur les services suivants GitHub, GitHub Actions, Artifactory, SonarQube et Concourse/Jenkins à l'aide de Kubernetes.\n\nNous sommes à la recherche de nouvelles personnes qui s'accompliront au sein de notre équipe formée de personnes passionnées favorisant la créativité et la participation pour renforcer l'équipe et répondre à la demande croissante de nos services.\n\nSi vous êtes passionné(e) par les technologies infonuagiques, curieux(euse) des nouvelles approches et outils, très bon(ne) joueur(euse) d'équipe en mode Agile, polyvalent(e) et engagé(e), nous avons l'opportunité pour vous!\nResponsabilités principales\nMaintenir la plateforme de livraison continue des environnements infonuagiques de Desjardins\nPréparer, documenter, implanter l'infrastructure et les outils de la plateforme\nParticiper à l'évolution et aux mises à jour de la plateforme\nInvestiguer et résoudre les incidents de production\nSoutenir et accompagner les escouades de développement dans l'implantation de leur solution de livraison d'applications.\nCo nditions particulières\nHoraire : La personne titulaire peut être amenée à assumer périodiquement du support informatique en dehors des heures de travail\nLieu de travail: Place d’affaires, Montréal ou Lévis, selon la préférence du candidat retenu. Le mode de travail s’appliquant au poste est le mode hybride #LI-Hybrid\nNombre d’emploi disponible : 1\nProfil recherché\nBaccalauréat dans une discipline appropriée\nUn minimum de quatre ans d’expérience pertinente\nExpérience dans l'opérationnalisation de solutions dans un environnement de production\nExpérience en mode Agile (un atout)\nVeuillez noter que d’autres combinaisons de formation et d’expérience pertinentes pourraient être considérées\nPour les postes vacants disponibles au Québec, veuillez noter que la connaissance du français est nécessaire\nConnaissances spécifiques\nTrès bonne connaissance de scripting Shell BASH\nConnaissance de l'architecture des plateformes et produits de livraison continue: GitHub, Artifactory et SonarQube\nConnaissance de Kubernetes et Docker\nConnaissance de plateforme infonuagique Azure\nConnaissance des concepts DevOps (CI/CD)\nConnaissance d’un outil de CI/CD basé sur Docker (GitHub Actions, GitLab, Concourse)\nConnaissance d'une plateforme infonuagique (Azure et/ou AWS)\nConnaissances de Python\nConnaissance du concept d'« Infrastructure as Code » avec des outils tels que Terraform\nConnaissance de l'outil de gestion de la configuration Ansible\nConnaissance Linux, Ubuntu et Red Hat\nConnaissances de Jenkins, Azure DevOps et HashiCorp Vault (un atout)\nCompétences transversales Desjardins\nApprécier les différences, Apprendre avec agilité, Être orienté client, Être orienté vers l’action\nCompétences clés au profil recherché\nGérer la complexité, Maîtriser la technologie, Planifier et coordonner\nLieu de travail\nComplexe Desjardins Montréal\nSyndicat\nNon Syndiqué\nDate de fin d'affichage\n2023-11-28\nFamille d'emplois\nTechnologies de l'information (GF)\nLe Mouvement Desjardins est le plus important groupe financier coopératif au Canada et l'un des principaux employeurs au pays. Il offre toute la gamme des produits et services financiers et regroupe les expertises en gestion de patrimoine, en assurance de personnes et de dommages, en service aux entreprises de toutes tailles, en valeurs mobilières, en gestion d'actifs, en capital de risque ainsi que des modes d'accès virtuels sécuritaires, à la fine pointe de la technologie.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=d68235f3c5a61ca2&fccid=d1e5df65baa8857f&vjs=3"
    },
    {
        "title": "DevOps Specialist",
        "description": "Role and Responsibilities\n\nDevOps Specialist\nIf you’ve taken a plane to any destination in the world, chances are, your pilot was trained by CAE. With its strong customer focus, the Digital Accelerator team is dedicated to elevating the training experience to make pilots the best they can be.\nHere are few reasons why folks love working at CAE!\nMeaningful work that drives professional development\nAbility to enter and grow within the technology industry\nWork in a collaborative environment\nBe part of a high-performance team\nYour Mission\nAs a DevOps specialist, your mission is to build and maintain our automation pipelines throughout IT and our Digital Accelerator division. These pipelines are used to deploy and maintain infrastructure and applications both on premises and in the cloud. While CAE already has a significant cloud footprint, your work will allow CAE to go the next level and adopt the cloud very widely.\nYour Role & Main Responsibilities\nCollaborate with the architecture team, the application teams, and the infrastructure team on key automation projects.\nBuild automation pipelines for a variety of scenarios from simple application servers to complex multi-resource cloud deployments.\nBuild our next application hosting platform built around Kubernetes and containers.\nActively participate in our application modernization roadmap and initiatives by building the right infrastructure and supporting application teams in their journey\nMeasure and optimize the effectiveness of our automation pipelines\nBuild automation to support disaster recovery scenarios\nBuild automation for the cloud (AWS, Azure, GCP)\nParticipate and lead internal development best practices sharing\nLeverage Azure DevOps to build this automation pipeline\nYour Qualifications\nSoft skills\nExcellent English and French written and verbal communication skills.\nBe a continuous learner and a self starter\nWork effectively in a fast-paced environment\nAbility to effectively prioritize work\nTechnical skills\nBachelor's degree in Computer Science, Engineering, or related\nGood knowledge of cloud infrastructure (AWS, Azure, Google, etc.)\nGood knowledge of Kubernetes, Docker and the cloud native ecosystem\nGood knowledge of scripting languages (Python, Bash, PowerShell, etc.)\nGood knowledge of Linux and Windows system administration.\nGood knowledge of infrastructure as code tools (Terraform, ARM templates, cloud formation, etc.)\nGood knowledge of configuration management tools (Ansible, Puppet, Chef, etc.)\nGood understanding of networking and web protocols\nWhat we have to offer\nBenefits: fully flexible for you to choose what is important\nRetirement: Defined Benefits Retirement Plan & Group Registered Retirement Savings Plan (RRSP)\nFinancial Perks: Employee Stock Purchase Plan & numerous corporate discounts\nPersonal and Family Programs: Physical Wellness Plan & Supplementary Maternity Plan\nWork-Life Balance: Flextime & California Fridays all year\nFun at work: social and community events all-year round!\n#LI-CL1\n#LI-hybrid\nPosition Type\n\nRegular\nCAE thanks all applicants for their interest. However, only those whose background and experience match the requirements of the role will be contacted.\nEqual Employment Opportunity\nAt CAE, everyone is welcome to contribute to our success. With no exception.\nAs captured in our overarching value \"One CAE\", we’re proud to work as one passionate, boundaryless and inclusive team.\nAt CAE, all employees are welcome regardless of race, nationality, colour, religion, sex, gender identity or expression, sexual orientation, disability, neurodiversity or age.\nThe masculine form may be used in this job description solely for ease of reading, but refers to men, women and the gender diverse.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=5b77a2413869cef5&fccid=b839f9af280b111f&vjs=3"
    },
    {
        "title": "DevOps/ QA Automation",
        "description": "-4+ years of hands-on experience working on QA automation using Java\n-Experience in developing test automation for Web applications preferably using Cypress, Selenium, BDD Cucumber and Java\n-Experience in developing test automation within Agile projects\n-Experience in developing test automation for Backend applications preferably using rest assured.\n-Good knowledge about testing concepts and understanding of database concepts, OOPs concepts and strong in core Java skills.\n-Strong working knowledge of various test types including client/server, white-box, black-box, positive/negative, and relational database testing.\n-Solid test design skills, test case writing, automation and analysis.\n-Strong working knowledge of various test phases including functional, integration and regression\n-Ability to learn new things, architectural level details, innovative testing approach.\n-Strong analytical ability and problem-solving skills\n-Excellent interpersonal skills and professional approach\n-Setting up/Use of Continuous Integration tools\nBonus Skills:\n-Knowledge on Protractor, Typescript, Python\nJob Types: Full-time, Permanent, Fixed term contract\nSalary: $80,000.00-$90,000.00 per year\nBenefits:\nDental care\nExtended health care\nLife insurance\nRRSP match\nVision care\nSchedule:\n8 hour shift\nMonday to Friday\nAbility to commute/relocate:\nMontréal, QC H3C 3S4: reliably commute or plan to relocate before starting work (required)\nEducation:\nBachelor's Degree (preferred)\nExperience:\nquality assurance: 4 years (required)\nWork Location: In person",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/company/Synechron/jobs/Development-Operations-Engineer-c3003405a71d0a59?fccid=837edc3ec6c2367e&vjs=3"
    },
    {
        "title": "Devops",
        "description": "Prêt à relever le défi?\nINTELCOM est à la recherche d’un Devops pour se joindre à son équipe technologique en pleine croissance. Il/Elle se joindra à une équipe et approfondira ses connaissances sur l’ensemble des outils devops. Le Devops niveau 3 supportera l’équipe avec tous ses besoins DevOps en livrant des tâches complexes avec un minimum de directives, assurant la fiabilité, l’adaptabilité et la résistance des composantes de l’infrastructure.\nRESPONSABILITÉS\nLivraison des produits\nComprendre les besoins DevOps de l’équipe en relation avec AWS et Azure, et s’assurer qu’ils soient pris en charge dans un délai convenable en effectuant des tâches complexes avec un minimum de directives.\nTravailler avec l’équipe DevOps pour choisir et implanter les outils spécifiques à AWS et Azure, les pipelines de distribution et les processus pour permettre l’intégration et la livraison continues.\nAppropriation de l'exécution et responsabilisation\nAssumer la responsabilité quant à la fiabilité, l’adaptabilité et la résistance des composantes moyennement complexes et essentielles de l’infrastructure pour une ou plusieurs équipes (serveurs web, banques de données, services hébergés, équilibreurs de charge, etc.) en employant adéquatement la duplication, le sharding, l’équilibre des charges, le contrôle, les accords de niveau de service (SLA), les alertes et la mise à l’échelle automatique\nParticiper activement à la chaîne d’escalade des incidents et à leur résolution rapide\nAméliorer et corriger les systèmes lorsque nécessaire tout en garantissant la disponibilité du service\nDiffusion des connaissances et coaching\nParticiper activement à INTELCOM University, notre plateforme d’apprentissage entre pairs, afin d’accroître sa connaissance de différentes technologies, donnant une classe tous les 6 mois afin de promouvoir l’apprentissage continu\nMener l’intégration des nouveaux DevOps\nRecrutement\nParticiper aux activités de recrutement des ressources humaines et aider à la recherche et l’identification des meilleurs DevOps\nEXIGENCES\nBaccalauréat en informatique, ingénierie, ou un domaine technique connexe\nMaîtrise, un atout\nUn minimum de 3 années d’expérience dans la gestion d’environnements employant Linux (Red Hat, CentOS, Debian ou Ubuntu)\nUn minimum de 2 années d’expérience avec des architectures orientées vers le service, ainsi que dans le développement de logiciels et son cycle de vie\nUn minimum d’une année d’expérience dans la pratique d’intégration et livraison continues\nConnaissance des concepts d’automatisation des infrastructures et capacité à utiliser et structurer des recettes et formules complexes (Terraform et Ansible)\nCapacité à identifier les opportunités de cache et à les mettre en oeuvre avec assistance\nFamiliarité avec divers systèmes de base de données et capacité à écrire des requêtes complexes indépendamment\nConnaissances en matière de concepts Cloud et capacité à suivre des instructions afin de les appliquer avec assistance minime\nConnaissances en matière de concepts de conteneur et capacité à suivre des instructions afin de les appliquer avec assistance minime\nMaîtrise de Git\nMaîtrise de l’anglais tant à l’oral qu’à l’écrit, français un atout\nCOMPÉTENCES\nDétermination et capacité à apprendre rapidement\nHaute éthique de travail et esprit orienté vers les résultats\nSens aigu de la responsabilité\nOptimisme dynamique et emphase sur la recherche de solutions pour surmonter les défis\nEsprit d’équipe et aptitude naturelle à tisser des liens\nHabileté à prospérer dans les milieux dynamiques et à maîtriser les technologies et les techniques web en évolution fréquente\nIntelcom est une entreprise de logistique du dernier kilomètre chef de file dans le secteur du commerce électronique. Nos équipes d’un bout à l’autre du Canada ainsi que notre réseau d’entrepreneurs indépendants contribuent aux activités quotidiennes d’Intelcom.\nNotre objectif est simple : dans un secteur d’activité en constante évolution, nous ne nous contentons pas de suivre, nous prenons les devants. En plus de nous démarquer grâce à des méthodes de livraison et à des services novateurs, Intelcom opère aussi une transformation technologique où l’intégration de l’expérience client et les technologies logistiques sont au cœur de son évolution.\nChez Intelcom, nous savons que l'expérience se présente sous plusieurs formes et nous nous engageons à créer une culture où la différence est valorisée. Nous sommes toujours à la recherche de personnes talentueuses et diversifiées pour rejoindre nos équipes. Avec plus de 60 centres de livraison à travers le Canada, nous avons peut-être la la bonne opportunité pour vous.\nPostulez aujourd'hui.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=3e466c37ce5dffea&fccid=a3c50b78a611d187&vjs=3"
    },
    {
        "title": "DevOps Engineer/Consultant",
        "description": "Location: Remote\n\nMOBIA Technology Innovations is a Systems Integration company with multiple business unit areas: Broadband and Wireless Services, Managed Services, Infrastructure Solutions, Cybersecurity and Digital Transformation Services. Working with Service Providers, Government, Healthcare, and Enterprises across Canada, MOBIA has developed strategic business relationships with industry leading technology partners to help our customers achieve positive business outcomes.\nMOBIA is currently recruiting a DevOps Engineer to join our team for full-time employment, remotely. We are looking for someone that loves technology, enjoys working on many different types of projects, and that applies critical thinking and innovation to their work.\n\nKey Responsibilities:\nAs a DevOps Engineer/Consultant at MOBIA Technology Innovations, you will play a crucial role in driving the success of our clients' projects. Your responsibilities will include:\n\nDelivering Customer Projects: Collaborate with clients to implement DevOps methodologies and tooling, focusing on delivering repeatable, automated, and scalable solutions that meet their specific needs.\nPre-sales Scoping: Assist in pre-sales activities by providing technical expertise, scoping project requirements, and helping clients understand the benefits of DevOps solutions.\nKnowledge Management: Stay up to date with the latest industry tooling and trends that align with or enhance MOBIA Technology Innovations’ Go-to-Market strategy. Share your knowledge with the team and clients to ensure we always offer the best solutions.\nKey Attributes:\nTo thrive in this role, you should possess the following attributes:\n\nInquisitive Mindset: You are naturally curious and enjoy exploring new technologies and methodologies. You're not afraid to ask questions and seek out solutions to complex problems.\nEffective Communication: Strong communication skills are essential. You can convey technical concepts to both technical and non-technical stakeholders effectively. You also excel in active listening.\nCreative Problem Solver: You approach challenges with creativity and persistence. You're not just looking for quick fixes but are committed to finding sustainable solutions that drive long-term success.\nKeen Attention to Detail: You have a sharp eye for detail, allowing you to identify issues, inconsistencies, and opportunities for improvement. You take pride in your work's quality and precision.\nWhat You Will Bring:\nAs a DevOps Engineer/Consultant at MOBIA Technology Innovations, you will bring:\n\nTechnical Proficiency: A solid understanding of DevOps principles and practices, with experience in automating and optimizing software delivery and infrastructure management processes.\nAdaptability: The ability to quickly learn and adapt to new tools, technologies, and methodologies. While prior experience with our toolset is a plus, we value your capacity to embrace new challenges.\nPassion for Learning: A genuine passion for continuous learning and improvement. You are committed to staying current with industry trends and sharing your knowledge with the team.\nCollaborative Spirit: A collaborative mindset that thrives in a team-oriented environment. You enjoy working with diverse teams to solve complex problems and deliver outstanding results for clients.\nAdditional Qualifications:\nBachelor's degree in a related field (or equivalent experience)\nProven experience in DevOps engineering or consulting\nStrong problem-solving skills and attention to detail\nExcellent communication and interpersonal skills\nAbility to work effectively both independently and as part of a team\nNice to Haves:\nWhile not mandatory, the following certifications and skills are highly desirable for this role:\nCertifications in CNCF (CKA, CKS, CKAD)\nExperience with cloud platforms (GCP, AWS, Azure)\nInfrastructure as Code (Terraform)\nCI/CD (GitLab, GitHub Actions)\nMonitoring and observability (Datadog, Dynatrace)\nSecurity practices (Vault, Consul, DevSecOps)\nMOBIA strives to build an amazing workplace and was recognized as one of “Canada’s Best Managed Companies” since 2021.\n\nWe offer a comprehensive compensation and benefits package including an employer supported wellness plan, health, dental and life insurance coverage, company paid training, career development, and company events for fun and community contribution.\n\nWe thank all applicants for their interest. However, only those selected for an interview will be contacted.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=9de698359ba9b336&fccid=4ab968d1abe2d479&vjs=3"
    },
    {
        "title": "Lead DevOps Engineer",
        "description": "You are as unique as your background, experience and point of view. Here, you’ll be encouraged, empowered and challenged to be your best self. You'll work with dynamic colleagues - experts in their fields - who are eager to share their knowledge with you. Your leaders will inspire and help you reach your potential and soar to new heights. Every day, you'll have new and exciting opportunities to make life brighter for our Clients - who are at the heart of everything we do. Discover how you can make a difference in the lives of individuals, families and communities around the world.\nJob Description:\nAbout The role\nAre you an experienced Lead DevOps Engineer with a wide range of technical skills, a passion for driving innovation and experience working with multi-site teams (Montreal, Toronto, Waterloo, and Gurgaon, India)? If you excel in a collaborative environment and are eager to contribute to innovative projects, we have an exciting opportunity for you to join our dynamic team!\nYou will be part of a team that values communication, collaboration, transparency, and integrity. The successful candidate will have strong technical and problem-solving skills and will show initiative, be accepting of responsibility and be open to learning new skills and coaching others.\nWhat you will do:\nAnalyze, investigate, and recommend solutions for continuous improvements, process enhancements, identify pain points, and more efficient workflows. Create templates, standards, and models to facilitate future implementations and adjust priorities when necessary.\nDemonstrate that you are a collaborative communicator with architects, designers, business system analysts, application analysts, operation teams and testing specialists to deliver fully automated ALM systems. Confidently speaking up, bringing people together, facilitating meetings, recording minutes and actions, and rallying the team towards a common goal\nDeploy, configure, manage, and perform ongoing maintenance of technical infrastructure including all DevOps tooling used by our Canadian IT squads\nSet-up and maintain fully automated CI/CD pipeline for multiple Java / .NET environments using tools like Bitbucket, Jenkins, Ansible, Docker etc\nGuide development teams with the preparation of releases for production. This may include assisting in the automation of performance tests, validation of infrastructure requirements, and guiding the team with respect to system decisions\nCreate or improve the automated deployment processes, techniques, and tools\nTroubleshoot and resolve technical operational issues related to IT Infrastructure\nReview and analyze organizational needs and goals to determine future impacts to applications and systems\nEnsure information security standards and requirements are incorporated into all solutions\nStay current with trends in emerging technologies and how they could apply to Sun Life\nWhat you need to succeed:\n5+ years of continuous Integration and delivery (CI/CD) experience in a systems development life cycle environment using Bitbucket, Jenkins, CDD, etc\nSelf sufficient and experienced with either modern programming languages (eg. Java or C#), or scripting languages such as Python or similar.\nWorking knowledge of SQL, Tableau, Grafana.\nAdvanced knowledge of DevOps with a security and automation mindset\nKnowledge of using and configuring build tools and orchestration such as Jenkins, Azure DevOps, Sonarqube, Artifactory, Docker, Kubernetes, OpenShift, Ansible, Continuous Delivery Director (CDD)\nAdvanced knowledge of deployment (i.e. Ansible, Chef) and containerization (Docker/Kubernetes) tooling IAAS/PAAS/SAAS deployment and operations experience\nExperience with native mobile development on iOS and/or Android is an asset\nExperience with Scripting languages\nExperience with source code management tools such as TFS, Bitbucket, Git\nAs this position is posted in several locations, we specify that bilingualism (French, English, both oral and written) is required for Quebec only for the frequent interactions with English and French-speaking colleagues or internal partners across Canada or worldwide.\nWhat’s in it for you?\nGreat Place to Work® Certified in Canada and the US.\nNamed 2021 “Best Places to Work” by Glassdoor\nCanada Award for Excellence for Mental Health at Work - 2021\nFlexible hybrid work model including in-country work-from-home if you prefer. #LI-Remote, or #LI-Hybrid.\nPension, stock and savings programs to help build and enhance your future financial security\nWork and professional development that is united by our Purpose: to help Clients and Employees achieve lifetime financial security and live healthier lives\nA friendly, collaborative and inclusive culture\nBe part of our continuous improvement journey in developing the next greatest digital enterprise experience.\nCompetitive salary and bonus structure influenced by market range data\nA common sense dress code, where you decide how you dress based on your day\nThe opportunity to move along a variety of career paths with amazing networking potential\nThe Base Pay range is for the primary location for which the job is posted. It may vary depending on the work location of the successful candidate or other factors. In addition to Base Pay, eligible Sun Life employees participate in various incentive plans, payment under which is discretionary and subject to individual and company performance. Certain sales focused roles have sales incentive plans based on individual or group sales results.\nDiversity and inclusion have always been at the core of our values at Sun Life. A diverse workforce with wide perspectives and creative ideas benefits our clients, the communities where we operate and all of us as colleagues. We welcome applications from qualified individuals from all backgrounds.\nPersons with disabilities who need accommodation in the application process or those needing job postings in an alternative format may e-mail a request to thebrightside@sunlife.com.\nAt Sun Life we strive to create a flexible work environment where our employees are empowered to do their best work. Several flexible work options are available and can be discussed throughout the selection process depending on the role requirements and individual needs.\nWe thank all applicants for showing an interest in this position. Only those selected for an interview will be contacted.\nSalary Range:\n82,000/82 000 - 135,000/135 000\nJob Category:\nIT - Application Development\nPosting End Date:\n30/11/2023",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=1bfad9c3968c332f&fccid=618943d89d0005a6&vjs=3"
    },
    {
        "title": "Devops Lead",
        "description": "Our client, a pioneer in the e-training and security domain, is actively seeking a seasoned DevOps Group Leader to join their dedicated team in Montreal on a contract-to-hire basis. This role is designed for a dynamic individual who is keen to take the helm of a talented DevOps team, driving the fusion of development and operations to achieve flawless operational continuity.\nRole Overview:\nThe DevOps Group Leader will be instrumental in steering the DevOps team, fostering an environment of growth and excellence. You will be entrusted with the critical task of refining DevOps methodologies, enhancing tools and systems, and ensuring alignment with the rigorous standards of the e-training and security industry. A blend of technical expertise, leadership prowess, and a zeal for perpetual improvement in DevOps methodologies is essential for this position.\nKey Responsibilities:\nSpearhead the DevOps engineering team, mentoring and leading by example in a high-stakes e-training and security setting.\nFacilitate collaboration among diverse teams to decipher project necessities and integrate development with operations seamlessly.\nArchitect and refine DevOps procedures, tools, and infrastructures, increasing efficiency and reliability of pivotal systems.\nAdminister the deployment, automation, and supervision of various environments, upholding industry compliance.\nPropel advancements in the DevOps pipeline and workflow to meet exceptional standards of quality and security.\nUphold the principles of security, scalability, and system performance, in line with strict industry demands.\nPartner with various teams to expedite problem-solving, ensuring the stability of vital systems.\nIncorporate new industry advancements in DevOps to keep our practices at the forefront of technology.\nTechnical Expertise:\nA degree in Computer Science, Engineering, or an adjacent discipline.\nA proven track record in a DevOps capacity, especially within high-regulation sectors such as aerospace, defense, or e-training and security.\nStrong team leadership abilities with a knack for mentorship in high-pressure scenarios.\nExpertise in DevOps methodologies and tools, with a commitment to upholding excellence.\nSkillful in scripting with languages like Python, Bash, or PowerShell.\nProficiency in configuration management (e.g., Ansible, Puppet) and infrastructure as code (e.g., Terraform).\nKnowledgeable in containerization and orchestration (e.g., Docker, Kubernetes).\nCompetence in cloud services (e.g., AWS, Azure, GCP) and CI/CD pipelines (e.g., Jenkins, GitLab CI).\nAn understanding of monitoring and logging instruments (e.g., Prometheus, ELK stack).\nA solid grasp of DevOps security best practices, particularly relevant to the industry.\nPerks (When becoming permanent):\nA competitive remuneration package.\nA comprehensive suite of benefits.\nExtensive opportunities for career progression.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AQFuPRZ6FKJB8sPXTj6zkNyu9vRFTtP-fpIPEVERdJE8qjTpEGmJMZTrpDD0k_WEo42PBCEOdB1wur3JhcL7jAksykThH8FDOC1NZZvegPM-ZZHxUnRi3XdPzXrUP_-Zq-Gx1O2AhaptdvsWuOF3LUiknmf9WS7kkoC5vLU_6Wkt2Jgbl8werD2VIkmnR5nJss6FYYfVPltdFiEO4Zy5L_d5ejCNzl9jme9iRcSCuQFAzeTxUYNy--iC9at-5umphA3EjLWV3qjAzBiRKDitpbb-3vYH9CP5IVML7Io85ZeQS-i-HRU43cf5bJDFhr3gpt_0mFO-pRjucX9Mb3SJz-jGo4e6wGldy4L0qv_BKVd_dE-FPiTuEawzWmE9Rk2FgGqXubq0DFT0bIQI0NrMPDQQs-loPvHNoLETQ5MaRBfXsp4qkkhQUVP56uIcL1Wy0spPT3Wpg6baIxvgIxxxa7ej2j3EPEFCnjFlF5zMCkSb_MAAhGW0gjPAm2ezhjlUgo2PeJaQXl5xRabeHDdDqGGmk0NQtZJd_pqOmOIhX9BZjuUU_pNVWYCkUiuXv828eKn7pERVWRMm-EDj9xkjXGe29VCDzradQJSL_YXfAN5pgPCPuM1sBwPcjE9-51bQncRWufvmJZcShd4kd8-VVvdjgaanEIvT6FmcTAh3LbHw==&xkcb=SoDO-_M3HCegYtQ3hZ0YbzkdCdPP&p=18&fvj=0&vjs=3"
    },
    {
        "title": "DevOps [#4500]",
        "description": "Alteo is looking for a DevOps for a permanent position based in Montreal.\n\n*** Hybrid work - up to 100% telecommuting ***\n\nAs a DevOps, you will be responsible for integrating technologies and implementing solutions to support infrastructure and development goals. You will collaborate with development, security, support and infrastructure teams to align business needs, identify improvement opportunities and foster a DevOps culture focused on collaboration and innovation.\n\nResponsibilities:\nPrepare and plan each sprint and manage the team's backlog.\nMonitor the team's mission and sprint objectives during daily meetings with team members.\nMeet with the various teams to gather their needs, and promote the support that the DevOps team can offer them.\nParticipate in the architecture, analysis and effort estimation of the various team tasks, and take part in the analysis of new technologies and plan their integration.\nProvide a vision for the future of the infrastructure and ensure that the organization is moving in this direction\nAct as an ambassador for the team and the company, promoting Agile values. Be able to train colleagues and document everything.\n\nProfile:\nDEC/BAC in computer science, software engineering or equivalent\n5+ years' experience in a DevOps team\nExperience as an analyst in diversified and complex IT environments\nSolid knowledge of networking, DevOps processes, Container, CI/CD, Security, Jenkins, Ansible, Windows Server, Hyper-V, .Net Framework, SQL Server, IIS, Microservices, APM;\nGood knowledge of IT systems development processes: analysis, architecture, planning, evaluation, development and implementation;\nExperience of working in an Agile environment\nAbility to implement a game plan, in order to integrate concrete and rapid solutions to complex problems, in a constantly evolving industry;\nTeam player with positive attitude, collaborative leader\nAbility to organize and manage priorities\nAnalytical and problem-solving skills\nIdeally bilingual in French and English\nTechnical stack:\nContinuous deployment and code review with BitBucket, Jenkins, Ansible, Powershell;\nSprint and backlog management;\nMicrosoft Visual Studio to work in .Net ASP.NET, ASP.NET MVC, WinForm, etc..;\nManagement Studio for SQL connected to Microsoft SQL Server;\nVisual Studio Code for React applications in TypeScript;\nSource management with Git;\nConfluence documentation.\n@@@@@\nAlteo est à la recherche d'un DevOps pour un emploi permanent basé à Montréal.\n\n*** Travail hybride - jusqu'à 100% télétravail ***\n\nEn tant que DevOps, vous serez responsable de l'intégration des technologies et la mise en œuvre de solutions pour soutenir l'infrastructure et les objectifs de développement. Vous collaborerez avec les équipes de développement, de sécurité, de soutien et d'infrastructure pour aligner les besoins opérationnels, identifier les opportunités d'amélioration et favoriser une culture DevOps axée sur la collaboration et l'innovation.\n\nResponsabilités:\nPréparer, planifier chaque sprint et gérer la feuille de route (backlog) de l’équipe\nAssurer le suivi de la mission de l’équipe et des objectifs du sprint lors des rencontres quotidiennes (daily) avec les membres de ton équipe\nRencontrer les différentes équipes afin de recueillir leurs besoins, et promouvoir le support que l’équipe DevOps peut leur offrir\nParticiper à l’architecture, l’analyse et l’estimation des efforts des différentes tâches de l’équipe et de participer à l'analyse des nouvelles technologies et de planifier leur intégration\nOffrir une vision d'avenir pour l'infrastructure et s'assurer que l'organisation avance en ce sens\nAgir à titre d’ambassadeur auprès de l'équipe et dans l’entreprise en faisant rayonner les valeurs agiles. Etre en mesure de former les collègues et de documenter le tout.\n\nProfil :\nDEC/BAC en informatique, génie logiciel ou équivalent\n5+ années d’expérience dans une équipe DevOps\nExpérience en tant qu’analyste dans des environnements informatiques diversifiés et complexes\nSolides connaissances en réseautique, des processus DevOps, Container, CI/CD, Sécurité, Jenkins, Ansible, Windows Server, Hyper-V, .Net Framework, SQL Server, IIS, Microservices, APM;\nBonnes connaissances en processus de développement de systèmes informatiques: analyse, architecture, planification, évaluation, développement et implantation;\nExpérience de travail dans un environnement Agile\nCapacité à mettre en place un plan de match, afin d’intégrer des solutions concrètes et rapides à des problèmes complexes, dans un domaine en constante évolution;\nJoueur d’équipe à l'attitude positive, leader collaboratif\nCapacité d'organisation et de gestion des priorités\nEsprit d’analyse et de résolution de problèmes\nIdéalement bilingue français, anglais\n\nStack technique:\nDéploiement continu et revue de code avec BitBucket, Jenkins, Ansible, Powershell;\nGestion du sprint et de la feuille de route (backlog);\nMicrosoft Visual Studio afin de travailler dans les produits .Net ASP.NET, ASP.NET MVC, WinForm, etc.;\nManagement studio pour SQL connecté à Microsoft SQL Server;\nVisual Studio Code pour les applications React en TypeScript;\nGestion des sources avec Git;\nDocumentation sous Confluence.",
        "location": "Montréal, QC",
        "link": "https://emplois.ca.indeed.com/rc/clk?jk=6a682dfae6143086&fccid=576e21bbdffe809f&vjs=3"
    }
]